# Reading data

In [2]:
import pandas as pd

In [7]:
df = pd.read_csv(r"C:\Users\user\Downloads\weather_data1.csv")

In [8]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            NaN        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            NaN        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            NaN        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny

# Missing values

In [9]:
df.isnull().sum()

City             0
Temperature_C    3
Humidity_%       1
Condition        0
dtype: int64

In [10]:
df_clean = df.dropna

In [11]:
df_clean

<bound method DataFrame.dropna of            City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            NaN        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            NaN        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            NaN        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny>

In [12]:
df =pd.read_csv(r"C:\Users\user\Downloads\weather_data1.csv")
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            NaN        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            NaN        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            NaN        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny

In [13]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            NaN        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            NaN        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            NaN        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny

In [15]:
df["Temperature_C"]=df["Temperature_C"].fillna(0)

In [16]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            0.0        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            0.0        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            0.0        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny

In [20]:
df["Temperature_C"]=df["Temperature_C"].fillna(df.Temperature_C.mean())

In [18]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            0.0        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            0.0        57.0     Rainy
5        Mumbai           33.0         NaN     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            0.0        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny

In [33]:
df["Humidity_%"]=df["Humidity_%"].fillna(df["Humidity_%"].mean())

In [34]:
df

           City  Temperature_C  Humidity_% Condition
0      Hyderbad           28.0        60.0     Sunny
1    Vijayawada           29.0        62.0     Sunny
2  Viskhapatnam            0.0        58.0    Cloudy
3      Kakinada           31.0        55.0    Cloudy
4      Banglore            0.0        57.0     Rainy
5        Mumbai           33.0         0.0     Rainy
6       Chennai           34.0        61.0     Sunny
7    Rajamundry           32.0        63.0    Cloudy
8         Eluru            0.0        64.0     Rainy
9    Anakapalli           29.0        62.0     Sunny